In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')
from tabulate import tabulate

In [2]:
df = pd.read_csv('Expanded_data_with_more_features.csv')
df

,Unnamed: 0,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
0,0,female,NaN,bachelor's degree,standard,none,married,regularly,yes,3.0,school_bus,< 5,71,71,74
1,1,female,group C,some college,standard,NaN,married,sometimes,yes,0.0,NaN,5 - 10,69,90,88
2,2,female,group B,master's degree,standard,none,single,sometimes,yes,4.0,school_bus,< 5,87,93,91
3,3,male,group A,associate's degree,free/reduced,none,married,never,no,1.0,NaN,5 - 10,45,56,42
4,4,male,group C,some college,standard,none,married,sometimes,yes,0.0,school_bus,5 - 10,76,78,75
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30636,816,female,group D,high school,standard,none,single,sometimes,no,2.0,school_bus,5 - 10,59,61,65
30637,890,male,group E,high school,standard,none,single,regularly,no,1.0,private,5 - 10,58,53,51
30638,911,female,NaN,high school,free/reduced,completed,married,sometimes,no,1.0,private,5 - 10,61,70,67
30639,934,female,group D,associate's degree,standard,completed,married,regularly,no,3.0,school_bus,5 - 10,82,90,93
30640,960,male,group B,some college,standard,none,married,never,no,1.0,school_bus,5 - 10,64,60,58

In [3]:
df.head()

,Unnamed: 0,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
0,0,female,NaN,bachelor's degree,standard,none,married,regularly,yes,3.0,school_bus,< 5,71,71,74
1,1,female,group C,some college,standard,NaN,married,sometimes,yes,0.0,NaN,5 - 10,69,90,88
2,2,female,group B,master's degree,standard,none,single,sometimes,yes,4.0,school_bus,< 5,87,93,91
3,3,male,group A,associate's degree,free/reduced,none,married,never,no,1.0,NaN,5 - 10,45,56,42
4,4,male,group C,some college,standard,none,married,sometimes,yes,0.0,school_bus,5 - 10,76,78,75

In [4]:
df.tail()

,Unnamed: 0,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
30636,816,female,group D,high school,standard,none,single,sometimes,no,2.0,school_bus,5 - 10,59,61,65
30637,890,male,group E,high school,standard,none,single,regularly,no,1.0,private,5 - 10,58,53,51
30638,911,female,NaN,high school,free/reduced,completed,married,sometimes,no,1.0,private,5 - 10,61,70,67
30639,934,female,group D,associate's degree,standard,completed,married,regularly,no,3.0,school_bus,5 - 10,82,90,93
30640,960,male,group B,some college,standard,none,married,never,no,1.0,school_bus,5 - 10,64,60,58

In [5]:
df.drop("Unnamed: 0", axis=1, inplace=True)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30641 entries, 0 to 30640
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Gender               30641 non-null  object
 1   EthnicGroup          28801 non-null  object
 2   ParentEduc           28796 non-null  object
 3   LunchType            30641 non-null  object
 4   TestPrep             28811 non-null  object
 5   ParentMaritalStatus  29451 non-null  object
 6   PracticeSport        30010 non-null  object
 7   IsFirstChild         29737 non-null  object
 8   NrSiblings           29069 non-null  float64
 9   TransportMeans       27507 non-null  object
 10  WklyStudyHours       29686 non-null  object
 11  MathScore            30641 non-null  int64
 12  ReadingScore         30641 non-null  int64
 13  WritingScore         30641 non-null  int64
dtypes: float64(1), int64(3), object(10)
memory usage: 3.3+ MB

In [7]:
# Changing data on WklyStudyHours columns
df['WklyStudyHours'] = df['WklyStudyHours'].str.replace("oct-05","5-10")

In [8]:
df.isna().sum()

Gender                    0
EthnicGroup            1840
ParentEduc             1845
LunchType                 0
TestPrep               1830
ParentMaritalStatus    1190
PracticeSport           631
IsFirstChild            904
NrSiblings             1572
TransportMeans         3134
WklyStudyHours          955
MathScore                 0
ReadingScore              0
WritingScore              0
dtype: int64

In [9]:
def data_analyze_col(df):
    cate_col = []
    num_col = []
    
    for col in df.columns:
        if df[col].dtype == object:
            cate_col.append(col)
        else:
            num_col.append(col)
    
    return cate_col, num_col

cate_col, num_col = data_analyze_col(df)

# Printing using tabulate
print(tabulate({"Categorical columns": cate_col, "Numerical columns": num_col}, headers="keys"))

Categorical columns    Numerical columns
---------------------  -------------------
Gender                 NrSiblings
EthnicGroup            MathScore
ParentEduc             ReadingScore
LunchType              WritingScore
TestPrep
ParentMaritalStatus
PracticeSport
IsFirstChild
TransportMeans
WklyStudyHours

# Categorical columns Analysis

In [10]:
def Cate_columns(col):
    print("Unique code of ",col,"is",df[col].unique()[0:2])
    print()
    print("Count values of ",col,"is",df[col].value_counts()[0:2])
    print()
    print("Mode value of ",col,"is",df[col].mode()[0])
    print()
    print("Total null values of",col,"is",df[col].isna().sum())

In [11]:
Cate_columns('EthnicGroup')

Unique code of  EthnicGroup is [nan 'group C']

Count values of  EthnicGroup is EthnicGroup
group C    9212
group D    7503
Name: count, dtype: int64

Mode value of  EthnicGroup is group C

Total null values of EthnicGroup is 1840

In [12]:
df['EthnicGroup'].fillna('group C',inplace=True)

In [13]:
Cate_columns('ParentEduc')

Unique code of  ParentEduc is ["bachelor's degree" 'some college']

Count values of  ParentEduc is ParentEduc
some college    6633
high school     5687
Name: count, dtype: int64

Mode value of  ParentEduc is some college

Total null values of ParentEduc is 1845

In [14]:
df['ParentEduc'].fillna('some college',inplace=True)

In [15]:
Cate_columns('TestPrep')

Unique code of  TestPrep is ['none' nan]

Count values of  TestPrep is TestPrep
none         18856
completed     9955
Name: count, dtype: int64

Mode value of  TestPrep is none

Total null values of TestPrep is 1830

In [16]:
df['TestPrep'].fillna('none',inplace=True)

In [17]:
Cate_columns('ParentMaritalStatus')

Unique code of  ParentMaritalStatus is ['married' 'single']

Count values of  ParentMaritalStatus is ParentMaritalStatus
married    16844
single      7097
Name: count, dtype: int64

Mode value of  ParentMaritalStatus is married

Total null values of ParentMaritalStatus is 1190

In [18]:
df['ParentMaritalStatus'].fillna('married',inplace=True)

In [19]:
Cate_columns('PracticeSport')

Unique code of  PracticeSport is ['regularly' 'sometimes']

Count values of  PracticeSport is PracticeSport
sometimes    15213
regularly    10793
Name: count, dtype: int64

Mode value of  PracticeSport is sometimes

Total null values of PracticeSport is 631

In [20]:
df['PracticeSport'].fillna('sometimes',inplace=True)

In [21]:
Cate_columns('IsFirstChild')

Unique code of  IsFirstChild is ['yes' 'no']

Count values of  IsFirstChild is IsFirstChild
yes    19082
no     10655
Name: count, dtype: int64

Mode value of  IsFirstChild is yes

Total null values of IsFirstChild is 904

In [22]:
df['IsFirstChild'].fillna('yes',inplace=True)

In [23]:
Cate_columns('TransportMeans')

Unique code of  TransportMeans is ['school_bus' nan]

Count values of  TransportMeans is TransportMeans
school_bus    16145
private       11362
Name: count, dtype: int64

Mode value of  TransportMeans is school_bus

Total null values of TransportMeans is 3134

In [24]:
df['TransportMeans'].fillna('school_bus',inplace=True)

In [25]:
Cate_columns('WklyStudyHours')

Unique code of  WklyStudyHours is ['< 5' '5 - 10']

Count values of  WklyStudyHours is WklyStudyHours
5 - 10    16246
< 5        8238
Name: count, dtype: int64

Mode value of  WklyStudyHours is 5 - 10

Total null values of WklyStudyHours is 955

In [26]:
df['WklyStudyHours'].fillna('5 - 10 ',inplace=True)

* Filled NAN rows with mean values.

# Numerical Columns Analysis

In [28]:
def Numerical_Analysis(col):
    print("Average value of ",col,"is",df[col].mean())
    print()
    print("Median Value of ",col,"is",df[col].median())
    print()
    print("Standard deviation value of",col,"is",df[col].std())
    print()
    print("Null values of ",col,"is",df[col].isna().sum())

In [29]:
 Numerical_Analysis('NrSiblings')

Average value of  NrSiblings is 2.1458942516082424

Median Value of  NrSiblings is 2.0

Standard deviation value of NrSiblings is 1.4582424759684511

Null values of  NrSiblings is 1572

In [30]:
df['NrSiblings'].fillna(2,inplace=True)

* Filling the Nan Values with Average values

# Storing Data into MYSQL Server

In [31]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\admin\anaconda3\lib\site-packages (8.4.0)
Note: you may need to restart the kernel to use updated packages.

In [32]:
pip install pymysql

Requirement already satisfied: pymysql in c:\users\admin\anaconda3\lib\site-packages (1.1.1)Note: you may need to restart the kernel to use updated packages.

In [33]:
import mysql.connector as sql
from sqlalchemy import create_engine

In [34]:
db = sql.connect(host='localhost',user='root',password='Moin1210')

In [35]:
mycursor=db.cursor()

In [36]:
mycursor.execute("CREATE DATABASE Student_Score_db")

In [39]:
engine = create_engine("mysql+pymysql://{user}:{pw}@{host}/{db}"
.format(host='localhost', db='Student_Score_db', user='root', pw='Moin1210'))

In [40]:
df.to_sql('Students_Data', engine, index=False)

30641

In [42]:
df.to_csv("E:\\about\\Students_data.csv")